In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [59]:
def category_age(age):
    if age < 20:
        return 'cat_0_20'
    elif  age < 40:
        return 'cat_20_40'
    elif age < 60:
        return 'cat_40_60'
    elif age < 80:
        return 'cat_60_80'  

    return 'cat_80_100'

In [63]:
df.drop(columns=['embarked', 'class', 'alive'], inplace=True)

In [60]:
df = pd.read_csv('titanic_for_mac_users.csv')

In [64]:
df

,survived,pclass,sex,age,sibsp,parch,fare,who,adult_male,deck,embark_town,alone
0,0,3,male,22.0,1,0,7.2500,man,True,NaN,Southampton,False
1,1,1,female,38.0,1,0,71.2833,woman,False,C,Cherbourg,False
2,1,3,female,26.0,0,0,7.9250,woman,False,NaN,Southampton,True
3,1,1,female,35.0,1,0,53.1000,woman,False,C,Southampton,False
4,0,3,male,35.0,0,0,8.0500,man,True,NaN,Southampton,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,man,True,NaN,Southampton,True
887,1,1,female,19.0,0,0,30.0000,woman,False,B,Southampton,True
888,0,3,female,NaN,1,2,23.4500,woman,False,NaN,Southampton,False
889,1,1,male,26.0,0,0,30.0000,man,True,C,Cherbourg,True
890,0,3,male,32.0,0,0,7.7500,man,True,NaN,Queenstown,True

In [65]:
df.dropna(subset=['age'], inplace=True)

In [66]:


df['age'] = df['age'].astype(int)

In [67]:
df

,survived,pclass,sex,age,sibsp,parch,fare,who,adult_male,deck,embark_town,alone
0,0,3,male,22,1,0,7.2500,man,True,NaN,Southampton,False
1,1,1,female,38,1,0,71.2833,woman,False,C,Cherbourg,False
2,1,3,female,26,0,0,7.9250,woman,False,NaN,Southampton,True
3,1,1,female,35,1,0,53.1000,woman,False,C,Southampton,False
4,0,3,male,35,0,0,8.0500,man,True,NaN,Southampton,True
...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39,0,5,29.1250,woman,False,NaN,Queenstown,False
886,0,2,male,27,0,0,13.0000,man,True,NaN,Southampton,True
887,1,1,female,19,0,0,30.0000,woman,False,B,Southampton,True
889,1,1,male,26,0,0,30.0000,man,True,C,Cherbourg,True
890,0,3,male,32,0,0,7.7500,man,True,NaN,Queenstown,True

In [68]:
df['age_category'] = df['age'].apply(category_age)

In [69]:
df

,survived,pclass,sex,age,sibsp,parch,fare,who,adult_male,deck,embark_town,alone,age_category
0,0,3,male,22,1,0,7.2500,man,True,NaN,Southampton,False,cat_20_40
1,1,1,female,38,1,0,71.2833,woman,False,C,Cherbourg,False,cat_20_40
2,1,3,female,26,0,0,7.9250,woman,False,NaN,Southampton,True,cat_20_40
3,1,1,female,35,1,0,53.1000,woman,False,C,Southampton,False,cat_20_40
4,0,3,male,35,0,0,8.0500,man,True,NaN,Southampton,True,cat_20_40
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39,0,5,29.1250,woman,False,NaN,Queenstown,False,cat_20_40
886,0,2,male,27,0,0,13.0000,man,True,NaN,Southampton,True,cat_20_40
887,1,1,female,19,0,0,30.0000,woman,False,B,Southampton,True,cat_0_20
889,1,1,male,26,0,0,30.0000,man,True,C,Cherbourg,True,cat_20_40
890,0,3,male,32,0,0,7.7500,man,True,NaN,Queenstown,True,cat_20_40

In [71]:
df['age_category'].value_counts()

age_category
cat_20_40     387
cat_0_20      164
cat_40_60     137
cat_60_80      25
cat_80_100      1
Name: count, dtype: int64

In [72]:
df.groupby(['age_category', 'pclass']).count()['survived'].reset_index()

   age_category  pclass  survived
0      cat_0_20       1        21
1      cat_0_20       2        35
2      cat_0_20       3       108
3     cat_20_40       1        84
4     cat_20_40       2       101
5     cat_20_40       3       202
6     cat_40_60       1        64
7     cat_40_60       2        33
8     cat_40_60       3        40
9     cat_60_80       1        16
10    cat_60_80       2         4
11    cat_60_80       3         5
12   cat_80_100       1         1

In [73]:
df = pd.DataFrame({
    'name': ['Emily', 'Emily', 'James', 'James'],
    'subject': ['Literature', 'Mathematics', 'Literature', 'Mathematics'],
    'max_score': [120, 150, 120, 150],
    'curr_score': [98, 78, 80, 131]
    })

In [74]:
df

    name      subject  max_score  curr_score
0  Emily   Literature        120          98
1  Emily  Mathematics        150          78
2  James   Literature        120          80
3  James  Mathematics        150         131

In [77]:
def return_in_per(mx_sxore, curr_score):
    r = (curr_score / mx_sxore) * 100
    return f"{round(r, 2)}%"

In [78]:
return_in_per(150, 78)

'52.0%'

In [79]:
df[['max_score', 'curr_score']].apply(lambda var_df: return_in_per(var_df['max_score'], var_df['curr_score']), axis=1)

0    81.67%
1     52.0%
2    66.67%
3    87.33%
dtype: object